Конфигурация/src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <tabularSections>
    <name>СписокКлиентов</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Маршруты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция ПолучитьРайонКлиентаНаСервере(Клиент)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Клиенты.Ссылка,
    |    Клиенты.Район.Наименование КАК РайонНаименование
    |ИЗ
    |    Справочник.Клиенты КАК Клиенты
    |ГДЕ
    |    Клиенты.Ссылка = &Клиент";
    
    Запрос.УстановитьПараметр("Клиент", Клиент);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.РайонНаименование;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаСервере
Функция КлиентУжеВСписке(Клиент, ТекущаяСтрока = Неопределено)
    
    Если Клиент = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Для Каждого СтрокаКлиент Из Объект.СписокКлиентов Цикл
        // Пропускаем текущую строку при проверке
        Если СтрокаКлиент = ТекущаяСтрока Тогда
            Продолжить;
        КонецЕсли;
        
        Если СтрокаКлиент.Клиент = Клиент Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Ложь;
    
КонецФункции

&НаКлиенте
Процедура СписокКлиентовКлиентПриИзменении(Элемент)
    
    // Получаем текущую строку табличной части
    ТекущаяСтрока = Элементы.СписокКлиентов.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем выбранного клиента
    Клиент = ТекущаяСтрока.Клиент;
    
    Если Клиент = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Проверяем, есть ли уже такой клиент в списке (кроме текущей строки)
//    Если КлиентУжеВСписке(Клиент, ТекущаяСтрока) Тогда
//        Сообщить("Этот клиент уже есть в списке!");
//        ТекущаяСтрока.Клиент = Неопределено;
//        Возврат;
//    КонецЕсли;
    
    Район = ПолучитьРайонКлиентаНаСервере(Клиент);
    
  	ТекущаяСтрока.Район = Район;
КонецПроцедуры
